# Example Queries

In [13]:
from time import time
import configparser
import matplotlib.pyplot as plt
import pandas as pd

In [14]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

## Load Configuration

In [15]:
config = configparser.ConfigParser()
config.read_file(open('dwh.cfg'))
KEY=config.get('AWS','key')
SECRET= config.get('AWS','secret')

DWH_DB= config.get("CLUSTER","DB_NAME")
DWH_DB_USER= config.get("CLUSTER","DB_USER")
DWH_DB_PASSWORD= config.get("CLUSTER","DB_PASSWORD")
DWH_PORT = config.get("CLUSTER","DB_PORT")

DWH_ENDPOINT=config.get("CLUSTER","HOST")
DWH_ROLE_ARN=config.get("IAM_ROLE","ARN")

In [16]:
conn_string="postgresql://{}:{}@{}:{}/{}".format(DWH_DB_USER, DWH_DB_PASSWORD, DWH_ENDPOINT, DWH_PORT,DWH_DB)
print(conn_string)
%sql $conn_string

postgresql://xxx:xxx@redshift-cluster-1.xxx.us-west-2.redshift.amazonaws.com:5439/dev

'Connected: xxx@dev'

## Simple Queries

In [17]:
%%sql
select * from songplays limit 5;

 * postgresql://xxx:***@redshift-cluster-1.xxx.us-west-2.redshift.amazonaws.com:5439/dev
5 rows affected.

[(2, 1542738576796, '49', 'SOGZANN12AB018736A', 'ARCGJ6U1187FB4D01F', 758, 'San Francisco-Oakland-Hayward, CA', 'Mozilla/5.0 (Windows NT 5.1; rv:31.0) Gecko/20100101 Firefox/31.0'),
 (6, 1543258003796, '80', 'SOMODCT12A8C137EAA', 'ARCGJ6U1187FB4D01F', 933, 'Portland-South Portland, ME', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.143 Safari/537.36"'),
 (10, 1542738576796, '49', 'SOOXREI12A8C133901', 'ARCGJ6U1187FB4D01F', 758, 'San Francisco-Oakland-Hayward, CA', 'Mozilla/5.0 (Windows NT 5.1; rv:31.0) Gecko/20100101 Firefox/31.0'),
 (14, 1541269150796, '95', 'SOPANEB12A8C13E81E', 'ARSW5F51187FB4CFC9', 152, 'Winston-Salem, NC', '"Mozilla/5.0 (iPhone; CPU iPhone OS 7_1_2 like Mac OS X) AppleWebKit/537.51.2 (KHTML, like Gecko) Version/7.0 Mobile/11D257 Safari/9537.53"'),
 (18, 1543440657796, '73', 'SOPLJVF12A8C13FD43', 'ARSW5F51187FB4CFC9', 954, 'Tampa-St. Petersburg-Clearwater, FL', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.78.2 (KHTML, like Gecko) Version/7.0.6 Safari/537.78.2"')]

In [18]:
%%sql
select * from users limit 5;

 * postgresql://xxx:***@redshift-cluster-1.xxx.us-west-2.redshift.amazonaws.com:5439/dev
5 rows affected.

[('101', 'Jayden', 'Fox', 'M', 'free'),
 ('66', 'Kevin', 'Arellano', 'M', 'free'),
 ('86', 'Aiden', 'Hess', 'M', 'free'),
 ('15', 'Lily', 'Koch', 'F', 'paid'),
 ('80', 'Tegan', 'Levine', 'F', 'free')]

In [19]:
%%sql
select * from songs limit 5;

 * postgresql://xxx:***@redshift-cluster-1.xxx.us-west-2.redshift.amazonaws.com:5439/dev
5 rows affected.

[('SOONYFK12A6D4F442C', ' Dry Techterlech', 0, 'AR2SZ2A1187FB5A5FF', 231.83628),
 ('SOWDPLF12A8C1354E3', '#1 Fan', 1997, 'AREQGUQ1187B98FE55', 184.37179),
 ('SOUCGZB12AB01827CB', '$40_000 Plus Interest', 2005, 'ARSQDRW1187FB38AE6', 410.33098),
 ('SOANTAD12A6D4F6CCC', "'Round Midnight (Live)", 0, 'ARJEL6T1187B9A0601', 476.57751),
 ('SOIYUEY12AB0184151', "'Round the Wheel", 2001, 'AR4QYVC1187B99985B', 495.90812)]

In [20]:
%%sql
select * from artists limit 5;

 * postgresql://xxx:***@redshift-cluster-1.xxx.us-west-2.redshift.amazonaws.com:5439/dev
5 rows affected.

[('ARTW7I31187B9A4CA9', '!!!', None, None, ''),
 ('ARHZZOQ1187B9AE734', "'t Hof Van Commerce", None, None, ''),
 ('AR2ZNXL1187B9B87A1', '1 Giant Leap', None, None, ''),
 ('AR4WA5Y1187B9AC434', '1000 Homo DJs', None, None, 'Chicago, IL'),
 ('AR9GUZF1187FB4D1BC', '10000 Maniacs', None, None, 'Jamestown, NY')]

In [21]:
%%sql
select * from time limit 5;

 * postgresql://xxx:***@redshift-cluster-1.xxx.us-west-2.redshift.amazonaws.com:5439/dev
5 rows affected.

[(1541121934796, datetime.datetime(2018, 11, 2, 1, 25, 34), 1, 2, 44, 11, 2018, 5),
 (1541122241796, datetime.datetime(2018, 11, 2, 1, 30, 41), 1, 2, 44, 11, 2018, 5),
 (1541126568796, datetime.datetime(2018, 11, 2, 2, 42, 48), 2, 2, 44, 11, 2018, 5),
 (1541129561796, datetime.datetime(2018, 11, 2, 3, 32, 41), 3, 2, 44, 11, 2018, 5),
 (1541135741796, datetime.datetime(2018, 11, 2, 5, 15, 41), 5, 2, 44, 11, 2018, 5)]

## Analytic Queries

### song playing frequencies distrubute by time

In [24]:
%%sql
select count(1), year from songplays join time on songplays.start_time= time.start_time group by year

 * postgresql://xxx:***@redshift-cluster-1.xxx.us-west-2.redshift.amazonaws.com:5439/dev
1 rows affected.

[(824, 2018)]

In [25]:
%%sql
select count(1), month from songplays join time on songplays.start_time= time.start_time group by month

 * postgresql://xxx:***@redshift-cluster-1.xxx.us-west-2.redshift.amazonaws.com:5439/dev
1 rows affected.

[(824, 11)]

In [27]:
%%sql
select day, count(1) from songplays join time on songplays.start_time= time.start_time group by day order by day

 * postgresql://xxx:***@redshift-cluster-1.xxx.us-west-2.redshift.amazonaws.com:5439/dev
30 rows affected.

[(1, 1),
 (2, 12),
 (3, 11),
 (4, 23),
 (5, 50),
 (6, 17),
 (7, 31),
 (8, 15),
 (9, 30),
 (10, 8),
 (11, 9),
 (12, 26),
 (13, 44),
 (14, 76),
 (15, 62),
 (16, 39),
 (17, 13),
 (18, 15),
 (19, 20),
 (20, 37),
 (21, 46),
 (22, 14),
 (23, 27),
 (24, 28),
 (25, 2),
 (26, 30),
 (27, 27),
 (28, 35),
 (29, 40),
 (30, 36)]

### Who play most songs

In [33]:
%%sql
select first_name, last_name, count(1) as count from songplays join users on songplays.user_id= users.user_id group by songplays.user_id, users.first_name, users.last_name order by count desc limit 10

 * postgresql://xxx:***@redshift-cluster-1.xxx.us-west-2.redshift.amazonaws.com:5439/dev
10 rows affected.

[('Tegan', 'Levine', 102),
 ('Chloe', 'Cuevas', 91),
 ('Kate', 'Harrell', 70),
 ('Aleena', 'Kirby', 52),
 ('Jacob', 'Klein', 39),
 ('Lily', 'Koch', 39),
 ('Mohammad', 'Rodriguez', 35),
 ('Jacqueline', 'Lynch', 33),
 ('Layla', 'Griffin', 32),
 ('Matthew', 'Jones', 31)]

In [34]:
%%sql
select users.level, count(1) as count from songplays join users on songplays.user_id= users.user_id group by users.level

 * postgresql://xxx:***@redshift-cluster-1.xxx.us-west-2.redshift.amazonaws.com:5439/dev
2 rows affected.

[('free', 287), ('paid', 535)]

### The most popular song

In [36]:
%%sql
select songs.title, count(1) as count from songplays join songs on songplays.song_id= songs.song_id group by songs.song_id, songs.title  order by count desc limit 10

 * postgresql://xxx:***@redshift-cluster-1.xxx.us-west-2.redshift.amazonaws.com:5439/dev
10 rows affected.

[("You're The One", 37),
 ('Secrets', 17),
 ("I CAN'T GET STARTED", 9),
 ('Catch You Baby (Steve Pitron & Max Sanna Radio Edit)', 9),
 ("Nothin' On You [feat. Bruno Mars] (Album Version)", 8),
 ('Float On', 7),
 ('Stronger', 7),
 ("Let's Get It Started", 6),
 ("Hey Daddy (Daddy's Home)", 6),
 ('Up Up & Away', 5)]

### The most popular artist

In [37]:
%%sql
select artists.name, count(1) as count from songplays join artists on songplays.artist_id= artists.artist_id group by artists.name, artists.artist_id  order by count desc limit 10

 * postgresql://xxx:***@redshift-cluster-1.xxx.us-west-2.redshift.amazonaws.com:5439/dev
10 rows affected.

[('Dwight Yoakam', 37),
 ('Percubaba', 25),
 ('OneRepublic', 22),
 ('Coldplay', 14),
 ('Lily Allen', 12),
 ('Dido', 10),
 ('Kid Cudi', 10),
 ('Kid Cudi / Kanye West / Common', 10),
 ('Kanye West', 9),
 ('Lonnie Gordon', 9)]